In [24]:
import pandas as pd
import csv

In [26]:
# The path to our CSV file
file = "Resources/daily_area.csv.txt"

# Read our purchase data into pandas
df = pd.read_csv(file,delim_whitespace=True)

df.rename(columns={"YYYY": "Year", "MM": "Month", "DD":"Day"},inplace = True)
df.head()

   Year  Month  Day  Total  North  South
0  1874      5    1   -1.0   -1.0   -1.0
1  1874      5    2   -1.0   -1.0   -1.0
2  1874      5    3   -1.0   -1.0   -1.0
3  1874      5    4   -1.0   -1.0   -1.0
4  1874      5    5   -1.0   -1.0   -1.0

In [27]:
# Remove row with missing readings (represented as -1)
df = df.loc[df['Total'] != '-1.0'].reset_index(drop=True)
df.head()

   Year  Month  Day  Total  North  South
0  1874      5    1   -1.0   -1.0   -1.0
1  1874      5    2   -1.0   -1.0   -1.0
2  1874      5    3   -1.0   -1.0   -1.0
3  1874      5    4   -1.0   -1.0   -1.0
4  1874      5    5   -1.0   -1.0   -1.0

In [41]:
year_needed= df.loc[df["Year"] > 2013, [
    "Year", "Month", "Day","Total","North","South"]]
year_needed.head()

       Year  Month  Day   Total  North   South
51014  2014      1    1   686.0   28.0   658.0
51015  2014      1    2   854.0   28.0   826.0
51016  2014      1    3  1974.0   56.0  1918.0
51017  2014      1    4  2198.0   56.0  2142.0
51018  2014      1    5  2394.0   70.0  2324.0

In [42]:
year_needed.set_index(["Year"], inplace = True, 
                    append = True, drop = True) 
year_needed.head()

            Month  Day   Total  North   South
      Year
51014 2014      1    1   686.0   28.0   658.0
51015 2014      1    2   854.0   28.0   826.0
51016 2014      1    3  1974.0   56.0  1918.0
51017 2014      1    4  2198.0   56.0  2142.0
51018 2014      1    5  2394.0   70.0  2324.0

In [40]:
year_needed.describe()

             Month          Day        Total        North        South
count  1339.000000  1339.000000  1339.000000  1339.000000  1339.000000
mean      6.159821    15.727409   162.397909   109.495892    52.902016
std       3.360480     8.802751   283.043821   204.913684   154.996468
min       1.000000     1.000000     0.000000     0.000000     0.000000
25%       3.000000     8.000000     0.000000     0.000000     0.000000
50%       6.000000    16.000000    28.000000    14.000000     0.000000
75%       9.000000    23.000000   224.000000   133.000000    14.000000
max      12.000000    31.000000  2464.000000  1316.000000  1484.000000

In [45]:
year_needed.to_csv("output/sunspot_2014_19.csv")